app/Http/Controllers/ItemController.php

select distinct `main_category` from `items`
---
    public function MainCategories()
    {
       return Item::select('main_category')->distinct()->pluck('main_category');